---
type: ExternalResourceServerExtensions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ExternalResourceServerExtensions

`Autodesk.Revit.DB.ExternalResourceServerExtensions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCADLinkOperations | 2015 | `public CADLinkOperations GetCADLinkOperations ()` |
| Method | GetRevitLinkOperations | 2015 | `public RevitLinkOperations GetRevitLinkOperations ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |